// pages/planningPage/planningPage.js
Page({

  /**
   * 页面的初始数据
   */
  data: {
    Object1:[
      {
        "direction":"保研",
        "period":"第六学期目标状态",
        "detail":"1.获得保研资格：根据现行《中南大学推荐优秀应届本科毕业生免试攻读硕士学位研究生资格的管理办法》，学业成绩排名进入前35%可入围保研资格申请，申请者按照综合排名决定保研资格（一般为年级前20%，每年会动态调整，需要关注当年的保研名额）；卓越拔尖人才培养计划班学生学业成绩排名前80%可入围保研资格申请，申请者按照综合排名决定保研资格，保研比例为60%。\n\
        2.去理想的院校、课题组：\n\
        （1）成绩排名：越靠前的学校筛选简历对成绩排名要求越高。\n\
        （2）科研经历：良好的科研经历是从众多简历中脱颖而出的强加分项。最好能有科研论文发表，论文档次参考CCF推荐学术会议和期刊列表。专利和软著也可以在一定程度上证明自己的科研经历。需要有深入的科研经历，能够深入理解自己的科研课题，掌握实验和研究技能。\n\
        （3）竞赛成绩：学科竞赛也是简历加分项。建议贵精不贵多，重点在于体现自己的专业能力和科研潜力。\n\
        （4）项目经历：具有从事实际项目开发、开源代码贡献等经历，能体现自己的动手实际能力。\n\
        （5）专业基础：扎实的专业基础知识是进行科研工作的基础，保研过程中笔试与面试展示自己的专业水平。"
      },
      {
        "direction":"保研",
        "period":"大一上",
        "detail":"成绩要求：\n\
        综合成绩进入保研范围。\n\
        通过大学英语四级（550分以上在保研简历筛选中有竞争力）。\n\
        能力要求：\n\
        掌握高等数学的基本概念和理论，培养逻辑思维和逻辑推理能力。"
      },
    ]
  },

  /**
   * 生命周期函数--监听页面加载
   */
  onLoad(options) {

  },

  /**
   * 生命周期函数--监听页面初次渲染完成
   */
  onReady() {

  },

  /**
   * 生命周期函数--监听页面显示
   */
  onShow() {

  },

  /**
   * 生命周期函数--监听页面隐藏
   */
  onHide() {

  },

  /**
   * 生命周期函数--监听页面卸载
   */
  onUnload() {

  },

  /**
   * 页面相关事件处理函数--监听用户下拉动作
   */
  onPullDownRefresh() {

  },

  /**
   * 页面上拉触底事件的处理函数
   */
  onReachBottom() {

  },

  /**
   * 用户点击右上角分享
   */
  onShareAppMessage() {

  }
})